app/Controllers/ActiviteAPI.php

    public function index()
    {
        $result = $this->activiteRepo->findAll();
---
SELECT *
FROM `activite`