app/Controllers/EntiteAPI.php

SELECT *
FROM `R_Entite`
---
    public function index()
    {
        $result = $this->entiteRepo->findAll();