app/Controllers/PersonneApi.php

SELECT *
FROM `Personne`
---
    public function index()
    {
        $result = $this->personneRepo->findAll();