app/Controllers/ProvinceAPI.php

SELECT *
FROM `r_province`
---
    public function index()
    {
        $result = $this->provinceRepo->findAll();