app/Controllers/RegionAPI.php

    public function index()
    {
        $result = $this->regionRepo->findAll();
---
SELECT *
FROM `regions`

    public function show($id = null)
    {
        $result = $this->regionRepo->where('region_id', $id)->first();
---
SELECT *
FROM `regions`
WHERE `region_id` = '1'
 LIMIT 1