app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `email` = 'cherkaoui.mouad@live.fr'
 LIMIT 1
---
        } else {
            $userModel = new UserModel();

            $userdata = $userModel->where("email", $this->request->getVar("email"))->first();